title: Sobaken RAT detector (Sysmon).
description: Sobaken is a heavily modified version of Quasar with fewer functionalities to make the executable smaller. However, it does come with a fewanti-sandbox and other evasion techniques.
author: Alexandr Yampolskyi, SOC Prime
references:
- https://www.welivesecurity.com/wp-content/uploads/2018/07/ESET_Quasar_Sobaken_Vermin.pdf#page15
date: 2018/06/01
status: testing
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: "1"
    file_hash:
    - 087F77998004207BCCFFBF3030B6789648930FA5
    - 0A4A2BCB3EF4E19973D5C4BE4E141B665CC0BFE0
    - 1CEEF0813C0F096E6DA5461DC4B3BF901C500C56
    - 293DBFF0230DAB3C4C21428F90C8EF06E9F35608
    - 37E2947BFB5FC0839087C5BCE194EC193F824C85
    - 39525CBCA591F2A10946BA62A56E4C3382CD4FC0
    - 3CE0A18E9A8A2B95827008DBFF16364B6FEDF361
    - 3E869038080DAE006FF6B20DF9B0CD9CB3A5E1A1
    - 400830AB6DD46789B00D081ADF0F82623472FB13
    - 43F382A330A454FF83F4F35FB571ECF587A4694A
    - 4449FBE2B28A81B760B284880ADBED43462C2030
    - 4712AF28168FD728A13EFD520E0665FFD076B6FB
    - 4F504D7B35660943B206D6034752C686365EA58D
    - 53239A62E09BB0B4E49B7954D533258FEF3342C4
    - 540292753FA0CC4ACB49E5F11FEDEA4B7DEF11D8
    - 5589E8018DC7F934A8FDAB62670C9140AF31CAB6
    - 57BBA7D8786D3B0C5F93BC20AB505DF3F69C72D4
    - 630FE59D60F6882A0B9E35ED606BF06AD4BA048C
    - 63EA7C844D86882F491812813AAAD746738A6BE9
    - 64121FA2FD2E38AC85A911A9F7ADD8CA1E1A9820
    - 64DBA711FDD52FECF534CAC0C6FE8848FE36F196
    - 650AB5E674FEF431EBC8CF98141506DDC80C5E64
    - 6EF13E9D5B0B6FCB5EB2A7439AAD7B21EA7FB7AC
    - 7177F64362A504F3DF8AA815CEF7136D5A819C04
    - 9B91EC03A09C4CF6DBEC637B3551BDCA11F04A9B
    - A26764AFB1DAC34CAA2123F7BF3543D385147024
    - A55319D3DBD7B9A587F5156CF201C327C803FBC9
    - A841FF1EE379269F00261337A043448D3D72E6FD
    - AAB5BAAAE8A2577E1036769F0D349F553E4D129B
    - ACB989B3401780999474C5B1D7F9198ECA11549A
    - B65372E41E7761A68AEF87001BBB698D8D8D5EC6
    - BDB5E0B6CA0AA03E0BECA23B46A8420473091DFF
    - C4421084C19423D311A94D7BB6CB0169C44CBECD
    - C7E76993BB419DC755BD0C04255AB88E6C77B294
    - CF5238C467EBE2704528EED18AB4259BFDC604E3
    - D2334E161A1720E2DF048E4366150729B9395144
    - D35FB6E031720876482E728A40532703EF02A305
    - D82DF2903AA4BC5FD4274B5D1BFAF9E081771628
    - E4B3CBCA9A53B7B93177A270C2A76F981D157C34
    - E585AA2C5BFB9D42D2E58DB3833330D056713B9A
    - F4A485696FC871307C22906701CBBB3FA522499B
    - F5C75450108440D0BC9E7B210F072EF25A196D20
---
logsource:
  product: firewall
detection:
  selectionSRC:
    SourceIP:
    - 188.227.16.73
    - 212.116.121.46
    - 206.54.179.160
  selection1DST:
    DestinationIP:
    - 188.227.16.73
    - 212.116.121.46
    - 206.54.179.160
---
logsource:
  product: proxy
detection:
  selectionURL:
    Request Url:
    - akamaicdn.ru
    - akamainet021.info
    - cdnakamai.ru
    - windowsupdate.kiev.ua
    - akamainet022.info
    - akamainet066.info
    - akamainet067.info
    - notifymail.ru
    - mailukr.net
  condition: selection or selectionSRC or selection1DST or selectionURL
fields:
- Image
- TargetObject
- Hashes
falsepositives:
- Unknown
level: high
mitre-attack:
  Execution:
  - User Execution
  Command and Control:
  - Standard Application Layer Protocol