title: HIDDEN COBRA RAT/Worm.
description: HIDDEN COBRA RAT/Worm Detector.
references:
- https://www.us-cert.gov/ncas/analysis-reports/AR18-149A
author: Alexandr Yamposlkyi, SOC Prime
status: testing
date: 2018/06/29
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    EventID: "1"
    file_hash:
    - 4731cbaee7aca37b596e38690160a749
    - 80fac6361184a3e24b33f6acb8688a6b7276b0f2
    - 077d9e0e12357d27f7f0c336239e961a7049971446f7a3f10268d9439ef67885
    - 4613f51087f01715bf9132c704aea2c2
    - 6b1ddf0e63e04146d68cd33b0e18e668b29035c4
    - a1c483b0ee740291b91b11e18dd05f0a460127acfc19d47b446d11cd0e26d717
    - e86c2f4fc88918246bf697b6a404c3ea
    - 9b7609349a4b9128b9db8f11ac1c77728258862c
    - ea46ed5aed900cd9f01156a1cd446cbb3e10191f9f980e9f710ea1c20440c781
    - 298775b04a166ff4b8fbd3609e716945
    - 2e0f666831f64d7383a11b444e2c16b38231f481
    - fe7d35d19af5f5ae2939457a06868754b8bdd022e1ff5bdbe4e7c135c48f9a16
  selection2:
    EventID: "1"
    CommandLine:
    - cmd.exe /q /c net share adnim$=%SystemRoot%
    - cmd.exe /q /c net share adnim$=%%SystemRoot%% /GRANT:%s,FULL
    - cmd.exe /q /c net share adnim$ /delete
    - cmd.exe /q /c net share adnim$=%SystemRoot% /GRANT:Administrator,FULL
    - cmd.exe /q /c net share adnim$=%SystemRoot%
    - cmd.exe /q /c net share adnim$=%%SystemRoot%% /GRANT:%s,FULL
---
logsource:
  product: windows
  service: system
  selection3:
    EventID: "7045"
    ServiceName:
    - RdpCertification
---
logsource:
  product: proxy
  selection4:
    resource.agent:
    - Microsoft-WebDAV-MiniRedir/5.1.2600
---
logsource:
  product: proxy
  selection5:
    requestClientApplication:
    - Microsoft-WebDAV-MiniRedir/5.1.2600
  condition: selection1 or selection2 or selection3 or selection4 or selection 5
fields:
- Image
- User
- TargetObject
- Hashes
falsepositives:
- Unknown
level: high
mitre-attack:
  Persistence:
  - Component Firmware
  - Component Object Model Hijacking
  - External Remote Services