title: CoinMiner Malware Detector.
description: CoinMiner Malware Detector.
author: Alexandr Yampolskyi, SOC Prime
status: stable
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    EventID: "1"
    file_hash:
    - 71a9169b3915269707ca6f6025314f40
    - cdf775deb910db633b4f7fa9b99e2ee5
    - ddce3103661afac6cec23064eb2e695f
    - e2983edd4b37146334c7dd948587e062
    - 131ebe9f3e1a784cf663bf9393f37109
    - 7997aea216fcb62a90b944635fb4e2c8
    - 03307f15045c086c089b26d6125c963a
    - 8eadf5207fadcbb32953ea67cc704377
    - 045e518bcde86d35246cda92cbc86733
    - 1b10d3f0622b3a9e4210c583ab08ccfe
    - 0f16174de00f0feccc1290b512c08c00
    - 021feb6ece886069f79c0c2923a54a7f
    - 1a7f89dd8ef6376f60956c876cfcfb20
    - 833277fe1c65a4a0923de517fb3c36f5
    - fa7a8a7204476144998e24901c37ae3b
    - 543799fce4026075cff1a6129bf08559
    - 2a1a90c29abbef8ae87337a73057de9e
    - 12bbd4b40192e0d07e82075b49953066
    - 3f745b80dbc2dcd2d8e2b2f82fb33450
    - 403b158a11e96e9a8f62d698e07d5abc
    - 7a941d6969e6dcbb5b6ce17cc066a2c3
    - 7bcc2435159e1ee6d6e33bbb01b11aa6
    - 843d1e713fb57144e2121452b73cb625
    - 7175d675954e73dc0308446736f7da87
    - f741c037913127150ee9dd90e28c8862
    - 240e0c3771393774c2f975f854364801
    - f16701642e8ff00b66e4931f798f2951
    - f1db25aa1a700be143c6e591bbe2cac9
    - c6c81c9a0bcde29e459b2fa7c1fda8a0ef53a202
    - 6de9ff2996f1b0efbf513dc3a7f2156de5ae2368
    - fdc2759792ffda29c44e3b990e5c322c5344477e
    - 3c89dfabc7df4d486aaec2f2cf604c8df516b944
    - 4b3e0d79e85fafd299718df9a9d8fa1226c4b863
    - a72fd020265c9a6487b868d6f306c6439ad00137
    - b458789f8a25e0d1e4bb212cd232bf096b87fea2
    - 9ad3a1844e3c60a1f6dd2dbf2e2f8e9e2781b6e2
    - 2ce124aa8ed89384df1a08d723ae8a4a84acd3a8
    - 86fbebb6e5a1ef37dd70767b1bfccefc4447d437
    - 1f638fc59ddef1f8c02c4f25bb4b946f5550fb5a
    - b84de6eb6ceac77fe91018c893c109f8f507ce62
    - efb1ece92b3034e6180d7d3f4960b439b63d39bd
    - 74e1d19a2fbe7c27aa8e85e2d3c9b8637f359f07
    - ad5906e6f1ca567cf58aa64e2c670c6c09f9de45
    - 8d0947592c23ee7fc6328f9a59080b923671093e
    - 6271dedd1d5857c25a407346ec6e1747e208fa1a
    - 8109570b2ab18d9b2a3dd4a399cbe5361e19ab42
    - 32f5e34e291f0a18e043d3c3cb4eac3b0aeb39eb
    - 847c3a46875a3d69106c5954679b56c513724f76
    - cb2f05a15a57c68c2a45a2536f7c10103c6ad462
    - 3af3566cb146bd894751505ce2217e9aad8cb08b
    - 80887bc1d30da75f6eed914cf1dbc86d5f68cc38
    - dc233842df23d0d74fa995881f4572863702bb72
    - cace405d64af8f4a6b4777a337103f05d571d7e4
    - 393c3888c6427f1c71a7c87c57ac66cad5b7af79
    - 9a257a6c9d8a16c7f5b7f524d5cd266e3f7729a5
    - cf8212d62f96732a1a00b3431e2484aca925365e3fd10df554467d2d1c12c234
    - 7192914b64beb956b4acc42c272f3f4cfadd5912a54a3fd075df0d74bab0d910
    - 5c040e5d9fc2743beed4a0253b38d6cd65f0df617f929419e7f832e7dc4414e9
    - 86413bf9d1ca7e9ef2ebdf4f712c0913514b1025b32472a7c864f5ad286e13fc
    - 3ae3567126d4fb6f32b956199f82a26566709b9f699fb47fffd4a7842b2fc370
    - 23d632bf4848d108e5cbf9e721b1863366b8d12fcc147439cb436ab8149bfce4
    - e4df8631cefb5a9592a94ea6839ebc958fe6148fa8b0717ccba680df2ed7613c
    - 2622ac25fdca4589ad3f40f4eadafeae7b97edb7e6641e0e17d399b363e0163b
    - 7b79d7d7377ecf6915d5b50deab9efa35c6c99cb9c9f96d0e0891d54afe583ef
    - f1a24aa282719f3e804aa39be0060943a562f6ef6d99f9cd3e8668d18e499d8b
    - 26f845c835595eb0480dff5e5b3293cc8b6185b049827ccd41fd07d0054d33a6
    - 48660dfbc6befdc86a535ff3091169cbea525b3a69be94bd98abedf05ed3de10
    - 0402c64aa28a0aaa0c974005ddf72e287e4fd7f26b0c90a20894710ff0ec0df0
    - 7f5fbf1743b80daf28765c355d425cc6a3efaa60a6f78ec36a3d30adaf93e6fc
    - c5bad0cd06d7c064e28237c25af9f9cef652b57b62605bc7163f285f0c61215f
    - 2ba0cb69e844baab41f81d04a87c05213375d53b7bab3591876f3b2696dee10e
    - 5d98f12eda0a59b9cb6ac2464ec5066438cd468de2e08465a82f5e522f771c4c
    - 25cda2dd682a9ab3292cf5eeb05e5709df6433cd9082da80d2672f0cf3f25b61
    - 854510e6796fb7b77aed366289dcd0419b00c315dca80df17439b6b505a83c2c
    - 1dcac8ff586d29c0db5396096a52cd6c06b4ef8366d2604c7cbcd766b6bb6187
    - 923944fb58be94d7f0cfe4799cfd8f9294dd085326ebb40fc21aed6324f500a6
    - e74707c189cb07b9faaa8ca09238ed2e7393ebbfca544a07b17e03b63df116ff
    - 931e94286857f56dc2f4d88ad4ea62074c3ed5a24e077844ead08e79530703e6
    - a54237402db81a11a946d64c7b4754d92776dbc24264d3f6cc8cc3ac30eb585a
    - 074ce5c871e1ba99b12382ec450e29273bf0e0585a00a7c1ff0b69d34d2e7b1d
    - 461e703c0d8c0ff561767c3bea43fa3b019d2ecdcfe363299a9e6ec0f608d6e1
    - a9475d8ff59aaf5aff8f9d75306edbc2f9448325ba454f6e6f3d271321fec1fa
    - 3117a4e63685c09f5c3170805b7fe79b571be2eccb75c8dd30788f77dc4b0c7e
---
logsource:
  product: proxy
detection:
  selection2:
    Request Url:
    - zcop.ru
    - zc\xc3\xaf\xc2\xbf\xc2\xbdp.ru
    - xmr-eu1.nanopool.org
    - kr1s.ru
    - iplogger.co
    - http://88.99.66.31
    - http://89.111.178.201
    - http://195.208.1.107
    - ff2dead5a7.pw
    - 8a66446ab5.pw
    - http://51.15.65.182
  condition: selection1 or selection2
falsepositives:
- Unknown
level: high
mitre-attack:
  Execution:
  - User Execution
  - Standard Application Layer Protocol