title: Xbash Detector (Sysmon).
description: Xbash Combines Botnet, Ransomware, Coinmining in Worm that Targets Linux and Windows.
author: Alexandr Yampolskyi, SOC Prime
references:
- https://researchcenter.paloaltonetworks.com/2018/09/unit42-xbash-combines-botnet-ransomware-coinmining-worm-targets-linux-windows
date: 2018/09/17
status: stable
logsource:
  product: proxy
detection:
  selection1:
    Request Url:
    - http://3g2upl4pq6kufc4m.tk/zlibx
    - http://e3sas6tzvehwgpak.tk/XbashY
    - http://3g2upl4pq6kufc4m.tk/XbashY
    - http://3g2upl4pq6kufc4m.tk/xapache
    - http://3g2upl4pq6kufc4m.tk/libhttpd
    - http://xmr.enjoytopic.tk/l/rootv2.sh
    - http://xmr.enjoytopic.tk/l2/rootv2.sh
    - http://xmr.enjoytopic.tk/l/r88.sh
    - http://xmr.enjoytopic.tk/12/r88.sh
    - http://e3sas6tzvehwgpak.tk/lowerv2.sh
    - http://3g2upl4pq6kufc4m.tk/r88.sh
    - http://e3sas6tzvehwgpak.tk/XbashY
    - http://e3sas6tzvehwgpak.tk/XbashX
    - http://png.realtimenews.tk/m.png
    - http://daknobcq4zal6vbm.tk/tt.txt
    - http://d3goboxon32grk2l.tk/reg9.sct
    - https://pastebin.com/raw/Xu74Mzif
    - https://pastebin.com/raw/rBHjTZY6
    - ejectrift.censys.xyz
    - scan.censys.xyz
    - api.leakingprivacy.tk
    - news.realnewstime.xyz
    - scan.realnewstime.xyz
    - news.realtimenews.tk
    - scanaan.tk
    - scan.3g2upl4pq6kufc4m.tk
    - scan.vfk2k5s5tfjr27tz.tk
    - scan.blockbitcoin.tk
    - blockbitcoin.com
---
logsource:
  product: windows
  service: sysmon
detection:
  selection2:
    EventID: "1"
    file_hash:
    - 7a18c7bdf0c504832c8552766dcfe0ba33dd5493daa3d9dbe9c985c1ce36e5aa
    - 0b9c54692d25f68ede1de47d4206ec3cd2e5836e368794eccb3daa632334c641
    - dbc380cbfb1536dfb24ef460ce18bccdae549b4585ba713b5228c23924385e54
    - 5b790f02bdb26b6b6b270a5669311b4f231d17872aafb237b7e87b6bbb57426d
    - e59be6eec9629d376a8a4a70fe9f8f3eec7b0919019f819d44b9bdd1c429277c
    - f808a42b10cf55603389945a549ce45edc6a04562196d14f7489af04688f12bc
    - dcd37e5b266cc0cd3fab73caa63b218f5b92e9bd5b25cf1cacf1afdb0d8e76ff
    - de63ce4a42f06a5903b9daa62b67fcfbdeca05beb574f966370a6ae7fd21190d
    - 09968c4573580398b3269577ced28090eae4a7c326c1a0ec546761c623625885
    - a27acc07844bb751ac33f5df569fd949d8b61dba26eb5447482d90243fc739af
    - f888dda9ca1876eba12ffb55a7a993bd1f5a622a30045a675da4955ede3e4cb8
    - 31155bf8c85c6c6193842b8d09bda88990d710db9f70efe85c421f1484f0ee78
    - 725efd0f5310763bc5375e7b72dbb2e883ad90ec32d6177c578a1c04c1b62054
    - d7fbd2a4db44d86b4cf5fa4202203dacfefd6ffca6a0615dca5bc2a200ad56b6
    - ece3cfdb75aaabc570bf38af6f4653f73101c1641ce78a4bb146e62d9ac0cd50
---
logsource:
  product: firewall
detection:
  incoming:
    src:
    - 142.44.215.177
    - 144.217.61.147
  outgoing:
    dst:
    - 142.44.215.177
    - 144.217.61.147
  condition: selection1 or selection2 or incoming or outgoing
falsepositives:
- Unknown
level: High